//nums除了末尾，其他任何一个位置都可能是到达末尾前的最后一个位置
//每个位置所能到达的最远位置为：position+nums[position]
//当某个位置能到达的最远位置>=nums.length-1，说明该位置能够到达末尾位置 -> true
//当所有位置能到达的最远位置<nums.length-1 -> false
var canJump = function(nums){
    if(nums.length===1){return true}
    let reachable=0
    for(let i of nums.slice(0,nums.length-1).keys())
    {
        if(i<=reachable)
        {
            if(i+nums[i]>=nums.length-1){return true}
            else
            {reachable=Math.max(reachable,i+nums[i])}
        }
        else {return false}
    }
    return false
}

console.log(canJump([2, 4, 4, 3, 1, 1, 2, 1, 4, 1, 4, 1, 4, 3, 3, 3, 3, 4, 1, 4, 4, 4, 3, 3, 4, 3, 2, 4, 4, 2, 4, 4, 1, 4, 4, 2, 1, 4, 2, 4, 4, 4, 1, 3, 3, 2, 1, 3, 3, 2, 3, 3, 2, 4, 2, 4, 4, 4, 4, 1, 4, 3, 4, 1, 1, 2, 1, 1, 4, 3, 1, 1, 1, 2, 3, 4, 3, 2, 1, 2, 1, 3, 2, 1, 1, 4, 2, 3, 1, 4, 1, 2, 1, 4, 3, 3, 1, 2, 3, 3, 1, 1, 4, 3, 3, 3, 1, 2, 1, 3, 4, 1, 1, 3, 2, 3, 3, 4, 4, 3, 3, 2, 1, 2, 2, 3, 1, 4, 1, 3, 2, 4, 3, 3, 1, 3, 4, 3, 1, 4, 4, 3, 4, 1, 4, 1, 1, 2, 3, 3, 2, 2, 2, 1, 1, 3, 3, 4, 1, 2, 2, 3, 3, 2, 1, 3, 1, 1, 4, 4, 2, 1, 4, 1, 2, 1, 2, 2, 3, 4, 2, 4, 1, 2, 4, 4, 2, 4, 4, 2, 3, 3, 2, 1, 3, 1, 2, 1, 3, 3, 2, 1, 2, 2, 4, 3, 2, 2, 3, 3, 2, 2, 3, 3, 4, 3, 3, 1, 2, 1, 3, 1, 4, 3, 3, 1, 3, 3, 3, 2, 3, 4, 3, 4, 1, 2, 1, 1, 4, 2, 3, 3, 1, 4, 3, 1, 1, 4, 3, 4, 3, 3, 2, 2, 3, 2, 2, 2, 4, 2, 0, 0, 0, 0]));